Revit 2024 API
BuiltInFailures.OverlapFailures.DuplicateRebar Property
 There are identical rebar in the same place. This will result in double counting in schedules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DuplicateRebar { get; }
Visual Basic
Public Shared ReadOnly Property DuplicateRebar As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DuplicateRebar {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace